app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
          <!-- if you're not sure what the post references to, rails c on the terminal and check! "Post.new" look for what variable in this case 'user_id'-->
          <p class= "post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> <span class="post-creation">- <%= @p.created_at.to_formatted_s(:short) %></span></p>